MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F215RE/mcu.h
/******************  Bits definition for GPIO_PUPDR register  *****************/
#define GPIO_PUPDR_PUPD0                    0x00000003U
#define GPIO_PUPDR_PUPD0_0                  0x00000001U
#define GPIO_PUPDR_PUPD0_1                  0x00000002U
#define GPIO_PUPDR_PUPD1                    0x0000000CU
#define GPIO_PUPDR_PUPD1_0                  0x00000004U
#define GPIO_PUPDR_PUPD1_1                  0x00000008U
#define GPIO_PUPDR_PUPD2                    0x00000030U
#define GPIO_PUPDR_PUPD2_0                  0x00000010U
#define GPIO_PUPDR_PUPD2_1                  0x00000020U
#define GPIO_PUPDR_PUPD3                    0x000000C0U
#define GPIO_PUPDR_PUPD3_0                  0x00000040U
#define GPIO_PUPDR_PUPD3_1                  0x00000080U
#define GPIO_PUPDR_PUPD4                    0x00000300U
#define GPIO_PUPDR_PUPD4_0                  0x00000100U
#define GPIO_PUPDR_PUPD4_1                  0x00000200U
#define GPIO_PUPDR_PUPD5                    0x00000C00U
#define GPIO_PUPDR_PUPD5_0                  0x00000400U
#define GPIO_PUPDR_PUPD5_1                  0x00000800U
#define GPIO_PUPDR_PUPD6                    0x00003000U
#define GPIO_PUPDR_PUPD6_0                  0x00001000U
#define GPIO_PUPDR_PUPD6_1                  0x00002000U
#define GPIO_PUPDR_PUPD7                    0x0000C000U
#define GPIO_PUPDR_PUPD7_0                  0x00004000U
#define GPIO_PUPDR_PUPD7_1                  0x00008000U
#define GPIO_PUPDR_PUPD8                    0x00030000U
#define GPIO_PUPDR_PUPD8_0                  0x00010000U
#define GPIO_PUPDR_PUPD8_1                  0x00020000U
#define GPIO_PUPDR_PUPD9                    0x000C0000U
#define GPIO_PUPDR_PUPD9_0                  0x00040000U
#define GPIO_PUPDR_PUPD9_1                  0x00080000U
#define GPIO_PUPDR_PUPD10                   0x00300000U
#define GPIO_PUPDR_PUPD10_0                 0x00100000U
#define GPIO_PUPDR_PUPD10_1                 0x00200000U
#define GPIO_PUPDR_PUPD11                   0x00C00000U
#define GPIO_PUPDR_PUPD11_0                 0x00400000U
#define GPIO_PUPDR_PUPD11_1                 0x00800000U
#define GPIO_PUPDR_PUPD12                   0x03000000U
#define GPIO_PUPDR_PUPD12_0                 0x01000000U
#define GPIO_PUPDR_PUPD12_1                 0x02000000U
#define GPIO_PUPDR_PUPD13                   0x0C000000U
#define GPIO_PUPDR_PUPD13_0                 0x04000000U
#define GPIO_PUPDR_PUPD13_1                 0x08000000U
#define GPIO_PUPDR_PUPD14                   0x30000000U
#define GPIO_PUPDR_PUPD14_0                 0x10000000U
#define GPIO_PUPDR_PUPD14_1                 0x20000000U
#define GPIO_PUPDR_PUPD15                   0xC0000000U
#define GPIO_PUPDR_PUPD15_0                 0x40000000U
#define GPIO_PUPDR_PUPD15_1                 0x80000000U

/* Legacy defines */
#define GPIO_PUPDR_PUPDR0                   GPIO_PUPDR_PUPD0
#define GPIO_PUPDR_PUPDR0_0                 GPIO_PUPDR_PUPD0_0
#define GPIO_PUPDR_PUPDR0_1                 GPIO_PUPDR_PUPD0_1
#define GPIO_PUPDR_PUPDR1                   GPIO_PUPDR_PUPD1
#define GPIO_PUPDR_PUPDR1_0                 GPIO_PUPDR_PUPD1_0
#define GPIO_PUPDR_PUPDR1_1                 GPIO_PUPDR_PUPD1_1
#define GPIO_PUPDR_PUPDR2                   GPIO_PUPDR_PUPD2
#define GPIO_PUPDR_PUPDR2_0                 GPIO_PUPDR_PUPD2_0
#define GPIO_PUPDR_PUPDR2_1                 GPIO_PUPDR_PUPD2_1
#define GPIO_PUPDR_PUPDR3                   GPIO_PUPDR_PUPD3
#define GPIO_PUPDR_PUPDR3_0                 GPIO_PUPDR_PUPD3_0
#define GPIO_PUPDR_PUPDR3_1                 GPIO_PUPDR_PUPD3_1
#define GPIO_PUPDR_PUPDR4                   GPIO_PUPDR_PUPD4
#define GPIO_PUPDR_PUPDR4_0                 GPIO_PUPDR_PUPD4_0
#define GPIO_PUPDR_PUPDR4_1                 GPIO_PUPDR_PUPD4_1
#define GPIO_PUPDR_PUPDR5                   GPIO_PUPDR_PUPD5
#define GPIO_PUPDR_PUPDR5_0                 GPIO_PUPDR_PUPD5_0
#define GPIO_PUPDR_PUPDR5_1                 GPIO_PUPDR_PUPD5_1
#define GPIO_PUPDR_PUPDR6                   GPIO_PUPDR_PUPD6
#define GPIO_PUPDR_PUPDR6_0                 GPIO_PUPDR_PUPD6_0
#define GPIO_PUPDR_PUPDR6_1                 GPIO_PUPDR_PUPD6_1
#define GPIO_PUPDR_PUPDR7                   GPIO_PUPDR_PUPD7
#define GPIO_PUPDR_PUPDR7_0                 GPIO_PUPDR_PUPD7_0
#define GPIO_PUPDR_PUPDR7_1                 GPIO_PUPDR_PUPD7_1
#define GPIO_PUPDR_PUPDR8                   GPIO_PUPDR_PUPD8
#define GPIO_PUPDR_PUPDR8_0                 GPIO_PUPDR_PUPD8_0
#define GPIO_PUPDR_PUPDR8_1                 GPIO_PUPDR_PUPD8_1
#define GPIO_PUPDR_PUPDR9                   GPIO_PUPDR_PUPD9
#define GPIO_PUPDR_PUPDR9_0                 GPIO_PUPDR_PUPD9_0
#define GPIO_PUPDR_PUPDR9_1                 GPIO_PUPDR_PUPD9_1
#define GPIO_PUPDR_PUPDR10                  GPIO_PUPDR_PUPD10
#define GPIO_PUPDR_PUPDR10_0                GPIO_PUPDR_PUPD10_0
#define GPIO_PUPDR_PUPDR10_1                GPIO_PUPDR_PUPD10_1
#define GPIO_PUPDR_PUPDR11                  GPIO_PUPDR_PUPD11
#define GPIO_PUPDR_PUPDR11_0                GPIO_PUPDR_PUPD11_0
#define GPIO_PUPDR_PUPDR11_1                GPIO_PUPDR_PUPD11_1
#define GPIO_PUPDR_PUPDR12                  GPIO_PUPDR_PUPD12
#define GPIO_PUPDR_PUPDR12_0                GPIO_PUPDR_PUPD12_0
#define GPIO_PUPDR_PUPDR12_1                GPIO_PUPDR_PUPD12_1
#define GPIO_PUPDR_PUPDR13                  GPIO_PUPDR_PUPD13
#define GPIO_PUPDR_PUPDR13_0                GPIO_PUPDR_PUPD13_0
#define GPIO_PUPDR_PUPDR13_1                GPIO_PUPDR_PUPD13_1
#define GPIO_PUPDR_PUPDR14                  GPIO_PUPDR_PUPD14
#define GPIO_PUPDR_PUPDR14_0                GPIO_PUPDR_PUPD14_0
#define GPIO_PUPDR_PUPDR14_1                GPIO_PUPDR_PUPD14_1
#define GPIO_PUPDR_PUPDR15                  GPIO_PUPDR_PUPD15
#define GPIO_PUPDR_PUPDR15_0                GPIO_PUPDR_PUPD15_0
#define GPIO_PUPDR_PUPDR15_1                GPIO_PUPDR_PUPD15_1

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_IDR_ID0                        0x00000001U
#define GPIO_IDR_ID1                        0x00000002U
#define GPIO_IDR_ID2                        0x00000004U
#define GPIO_IDR_ID3                        0x00000008U
#define GPIO_IDR_ID4                        0x00000010U
#define GPIO_IDR_ID5                        0x00000020U
#define GPIO_IDR_ID6                        0x00000040U
#define GPIO_IDR_ID7                        0x00000080U
#define GPIO_IDR_ID8                        0x00000100U
#define GPIO_IDR_ID9                        0x00000200U
#define GPIO_IDR_ID10                       0x00000400U
#define GPIO_IDR_ID11                       0x00000800U
#define GPIO_IDR_ID12                       0x00001000U
#define GPIO_IDR_ID13                       0x00002000U
#define GPIO_IDR_ID14                       0x00004000U
#define GPIO_IDR_ID15                       0x00008000U

