MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F215RE/mcu.h
/*****************  Bit definition for SYSCFG_EXTICR2 register  ***************/
#define SYSCFG_EXTICR2_EXTI4_Pos        (0U)                                   
#define SYSCFG_EXTICR2_EXTI4_Msk        (0xFUL << SYSCFG_EXTICR2_EXTI4_Pos)     /*!< 0x0000000F */
#define SYSCFG_EXTICR2_EXTI4            SYSCFG_EXTICR2_EXTI4_Msk               /*!<EXTI 4 configuration */
#define SYSCFG_EXTICR2_EXTI5_Pos        (4U)                                   
#define SYSCFG_EXTICR2_EXTI5_Msk        (0xFUL << SYSCFG_EXTICR2_EXTI5_Pos)     /*!< 0x000000F0 */
#define SYSCFG_EXTICR2_EXTI5            SYSCFG_EXTICR2_EXTI5_Msk               /*!<EXTI 5 configuration */
#define SYSCFG_EXTICR2_EXTI6_Pos        (8U)                                   
#define SYSCFG_EXTICR2_EXTI6_Msk        (0xFUL << SYSCFG_EXTICR2_EXTI6_Pos)     /*!< 0x00000F00 */
#define SYSCFG_EXTICR2_EXTI6            SYSCFG_EXTICR2_EXTI6_Msk               /*!<EXTI 6 configuration */
#define SYSCFG_EXTICR2_EXTI7_Pos        (12U)                                  
#define SYSCFG_EXTICR2_EXTI7_Msk        (0xFUL << SYSCFG_EXTICR2_EXTI7_Pos)     /*!< 0x0000F000 */
#define SYSCFG_EXTICR2_EXTI7            SYSCFG_EXTICR2_EXTI7_Msk               /*!<EXTI 7 configuration */
/** 
  * @brief   EXTI4 configuration  
  */ 
#define SYSCFG_EXTICR2_EXTI4_PA         0x00000000U                            /*!<PA[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PB         0x00000001U                            /*!<PB[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PC         0x00000002U                            /*!<PC[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PD         0x00000003U                            /*!<PD[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PE         0x00000004U                            /*!<PE[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PF         0x00000005U                            /*!<PF[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PG         0x00000006U                            /*!<PG[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PH         0x00000007U                            /*!<PH[4] pin */
#define SYSCFG_EXTICR2_EXTI4_PI         0x00000008U                            /*!<PI[4] pin */
/** 
  * @brief   EXTI5 configuration  
  */ 
#define SYSCFG_EXTICR2_EXTI5_PA         0x00000000U                            /*!<PA[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PB         0x00000010U                            /*!<PB[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PC         0x00000020U                            /*!<PC[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PD         0x00000030U                            /*!<PD[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PE         0x00000040U                            /*!<PE[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PF         0x00000050U                            /*!<PF[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PG         0x00000060U                            /*!<PG[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PH         0x00000070U                            /*!<PH[5] pin */
#define SYSCFG_EXTICR2_EXTI5_PI         0x00000080U                            /*!<PI[5] pin */
/** 
  * @brief   EXTI6 configuration  
  */ 
#define SYSCFG_EXTICR2_EXTI6_PA         0x00000000U                            /*!<PA[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PB         0x00000100U                            /*!<PB[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PC         0x00000200U                            /*!<PC[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PD         0x00000300U                            /*!<PD[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PE         0x00000400U                            /*!<PE[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PF         0x00000500U                            /*!<PF[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PG         0x00000600U                            /*!<PG[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PH         0x00000700U                            /*!<PH[6] pin */
#define SYSCFG_EXTICR2_EXTI6_PI         0x00000800U                            /*!<PI[6] pin */
/** 
  * @brief   EXTI7 configuration  
  */ 
#define SYSCFG_EXTICR2_EXTI7_PA         0x00000000U                            /*!<PA[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PB         0x00001000U                            /*!<PB[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PC         0x00002000U                            /*!<PC[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PD         0x00003000U                            /*!<PD[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PE         0x00004000U                            /*!<PE[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PF         0x00005000U                            /*!<PF[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PG         0x00006000U                            /*!<PG[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PH         0x00007000U                            /*!<PH[7] pin */
#define SYSCFG_EXTICR2_EXTI7_PI         0x00008000U                            /*!<PI[7] pin */

/*****************  Bit definition for SYSCFG_EXTICR3 register  ***************/
#define SYSCFG_EXTICR3_EXTI8_Pos        (0U)                                   
#define SYSCFG_EXTICR3_EXTI8_Msk        (0xFUL << SYSCFG_EXTICR3_EXTI8_Pos)     /*!< 0x0000000F */
#define SYSCFG_EXTICR3_EXTI8            SYSCFG_EXTICR3_EXTI8_Msk               /*!<EXTI 8 configuration */
#define SYSCFG_EXTICR3_EXTI9_Pos        (4U)                                   
#define SYSCFG_EXTICR3_EXTI9_Msk        (0xFUL << SYSCFG_EXTICR3_EXTI9_Pos)     /*!< 0x000000F0 */
#define SYSCFG_EXTICR3_EXTI9            SYSCFG_EXTICR3_EXTI9_Msk               /*!<EXTI 9 configuration */
#define SYSCFG_EXTICR3_EXTI10_Pos       (8U)                                   
#define SYSCFG_EXTICR3_EXTI10_Msk       (0xFUL << SYSCFG_EXTICR3_EXTI10_Pos)    /*!< 0x00000F00 */
#define SYSCFG_EXTICR3_EXTI10           SYSCFG_EXTICR3_EXTI10_Msk              /*!<EXTI 10 configuration */
#define SYSCFG_EXTICR3_EXTI11_Pos       (12U)                                  
#define SYSCFG_EXTICR3_EXTI11_Msk       (0xFUL << SYSCFG_EXTICR3_EXTI11_Pos)    /*!< 0x0000F000 */
#define SYSCFG_EXTICR3_EXTI11           SYSCFG_EXTICR3_EXTI11_Msk              /*!<EXTI 11 configuration */
           
/** 
  * @brief   EXTI8 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI8_PA         0x00000000U                            /*!<PA[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PB         0x00000001U                            /*!<PB[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PC         0x00000002U                            /*!<PC[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PD         0x00000003U                            /*!<PD[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PE         0x00000004U                            /*!<PE[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PF         0x00000005U                            /*!<PF[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PG         0x00000006U                            /*!<PG[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PH         0x00000007U                            /*!<PH[8] pin */
#define SYSCFG_EXTICR3_EXTI8_PI         0x00000008U                            /*!<PI[8] pin */
/** 
  * @brief   EXTI9 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI9_PA         0x00000000U                            /*!<PA[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PB         0x00000010U                            /*!<PB[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PC         0x00000020U                            /*!<PC[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PD         0x00000030U                            /*!<PD[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PE         0x00000040U                            /*!<PE[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PF         0x00000050U                            /*!<PF[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PG         0x00000060U                            /*!<PG[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PH         0x00000070U                            /*!<PH[9] pin */
#define SYSCFG_EXTICR3_EXTI9_PI         0x00000080U                            /*!<PI[9] pin */
/** 
  * @brief   EXTI10 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI10_PA        0x00000000U                            /*!<PA[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PB        0x00000100U                            /*!<PB[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PC        0x00000200U                            /*!<PC[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PD        0x00000300U                            /*!<PD[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PE        0x00000400U                            /*!<PE[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PF        0x00000500U                            /*!<PF[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PG        0x00000600U                            /*!<PG[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PH        0x00000700U                            /*!<PH[10] pin */
#define SYSCFG_EXTICR3_EXTI10_PI        0x00000800U                            /*!<PI[10] pin */
/** 
  * @brief   EXTI11 configuration  
  */ 
#define SYSCFG_EXTICR3_EXTI11_PA        0x00000000U                            /*!<PA[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PB        0x00001000U                            /*!<PB[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PC        0x00002000U                            /*!<PC[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PD        0x00003000U                            /*!<PD[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PE        0x00004000U                            /*!<PE[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PF        0x00005000U                            /*!<PF[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PG        0x00006000U                            /*!<PG[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PH        0x00007000U                            /*!<PH[11] pin */
#define SYSCFG_EXTICR3_EXTI11_PI        0x00008000U                            /*!<PI[11] pin */

/*****************  Bit definition for SYSCFG_EXTICR4 register  ***************/
#define SYSCFG_EXTICR4_EXTI12_Pos       (0U)                                   
#define SYSCFG_EXTICR4_EXTI12_Msk       (0xFUL << SYSCFG_EXTICR4_EXTI12_Pos)    /*!< 0x0000000F */
#define SYSCFG_EXTICR4_EXTI12           SYSCFG_EXTICR4_EXTI12_Msk              /*!<EXTI 12 configuration */
#define SYSCFG_EXTICR4_EXTI13_Pos       (4U)                                   
#define SYSCFG_EXTICR4_EXTI13_Msk       (0xFUL << SYSCFG_EXTICR4_EXTI13_Pos)    /*!< 0x000000F0 */
#define SYSCFG_EXTICR4_EXTI13           SYSCFG_EXTICR4_EXTI13_Msk              /*!<EXTI 13 configuration */
#define SYSCFG_EXTICR4_EXTI14_Pos       (8U)                                   
#define SYSCFG_EXTICR4_EXTI14_Msk       (0xFUL << SYSCFG_EXTICR4_EXTI14_Pos)    /*!< 0x00000F00 */
#define SYSCFG_EXTICR4_EXTI14           SYSCFG_EXTICR4_EXTI14_Msk              /*!<EXTI 14 configuration */
#define SYSCFG_EXTICR4_EXTI15_Pos       (12U)                                  
#define SYSCFG_EXTICR4_EXTI15_Msk       (0xFUL << SYSCFG_EXTICR4_EXTI15_Pos)    /*!< 0x0000F000 */
#define SYSCFG_EXTICR4_EXTI15           SYSCFG_EXTICR4_EXTI15_Msk              /*!<EXTI 15 configuration */
/** 
  * @brief   EXTI12 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI12_PA        0x00000000U                            /*!<PA[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PB        0x00000001U                            /*!<PB[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PC        0x00000002U                            /*!<PC[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PD        0x00000003U                            /*!<PD[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PE        0x00000004U                            /*!<PE[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PF        0x00000005U                            /*!<PF[12] pin */
#define SYSCFG_EXTICR4_EXTI12_PG        0x00000006U                            /*!<PG[12] pin */
#define SYSCFG_EXTICR3_EXTI12_PH        0x00000007U                            /*!<PH[12] pin */
/** 
  * @brief   EXTI13 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI13_PA        0x00000000U                            /*!<PA[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PB        0x00000010U                            /*!<PB[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PC        0x00000020U                            /*!<PC[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PD        0x00000030U                            /*!<PD[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PE        0x00000040U                            /*!<PE[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PF        0x00000050U                            /*!<PF[13] pin */
#define SYSCFG_EXTICR4_EXTI13_PG        0x00000060U                            /*!<PG[13] pin */
#define SYSCFG_EXTICR3_EXTI13_PH        0x00000070U                            /*!<PH[13] pin */
/** 
  * @brief   EXTI14 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI14_PA        0x00000000U                            /*!<PA[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PB        0x00000100U                            /*!<PB[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PC        0x00000200U                            /*!<PC[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PD        0x00000300U                            /*!<PD[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PE        0x00000400U                            /*!<PE[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PF        0x00000500U                            /*!<PF[14] pin */
#define SYSCFG_EXTICR4_EXTI14_PG        0x00000600U                            /*!<PG[14] pin */
#define SYSCFG_EXTICR3_EXTI14_PH        0x00000700U                            /*!<PH[14] pin */
/** 
  * @brief   EXTI15 configuration  
  */ 
#define SYSCFG_EXTICR4_EXTI15_PA        0x00000000U                            /*!<PA[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PB        0x00001000U                            /*!<PB[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PC        0x00002000U                            /*!<PC[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PD        0x00003000U                            /*!<PD[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PE        0x00004000U                            /*!<PE[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PF        0x00005000U                            /*!<PF[15] pin */
#define SYSCFG_EXTICR4_EXTI15_PG        0x00006000U                            /*!<PG[15] pin */
#define SYSCFG_EXTICR3_EXTI15_PH        0x00007000U                            /*!<PH[15] pin */

/******************  Bit definition for SYSCFG_CMPCR register  ****************/  
#define SYSCFG_CMPCR_CMP_PD_Pos         (0U)                                   
#define SYSCFG_CMPCR_CMP_PD_Msk         (0x1UL << SYSCFG_CMPCR_CMP_PD_Pos)      /*!< 0x00000001 */
#define SYSCFG_CMPCR_CMP_PD             SYSCFG_CMPCR_CMP_PD_Msk                /*!<Compensation cell ready flag */
#define SYSCFG_CMPCR_READY_Pos          (8U)                                   
#define SYSCFG_CMPCR_READY_Msk          (0x1UL << SYSCFG_CMPCR_READY_Pos)       /*!< 0x00000100 */
#define SYSCFG_CMPCR_READY              SYSCFG_CMPCR_READY_Msk                 /*!<Compensation cell power-down */

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define TIM_CR1_CEN_Pos           (0U)                                         
#define TIM_CR1_CEN_Msk           (0x1UL << TIM_CR1_CEN_Pos)                    /*!< 0x00000001 */
#define TIM_CR1_CEN               TIM_CR1_CEN_Msk                              /*!<Counter enable */
#define TIM_CR1_UDIS_Pos          (1U)                                         
#define TIM_CR1_UDIS_Msk          (0x1UL << TIM_CR1_UDIS_Pos)                   /*!< 0x00000002 */
#define TIM_CR1_UDIS              TIM_CR1_UDIS_Msk                             /*!<Update disable */
#define TIM_CR1_URS_Pos           (2U)                                         
#define TIM_CR1_URS_Msk           (0x1UL << TIM_CR1_URS_Pos)                    /*!< 0x00000004 */
#define TIM_CR1_URS               TIM_CR1_URS_Msk                              /*!<Update request source */
#define TIM_CR1_OPM_Pos           (3U)                                         
#define TIM_CR1_OPM_Msk           (0x1UL << TIM_CR1_OPM_Pos)                    /*!< 0x00000008 */
#define TIM_CR1_OPM               TIM_CR1_OPM_Msk                              /*!<One pulse mode */
#define TIM_CR1_DIR_Pos           (4U)                                         
#define TIM_CR1_DIR_Msk           (0x1UL << TIM_CR1_DIR_Pos)                    /*!< 0x00000010 */
#define TIM_CR1_DIR               TIM_CR1_DIR_Msk                              /*!<Direction */

#define TIM_CR1_CMS_Pos           (5U)                                         
#define TIM_CR1_CMS_Msk           (0x3UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000060 */
#define TIM_CR1_CMS               TIM_CR1_CMS_Msk                              /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0             (0x1UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000020 */
#define TIM_CR1_CMS_1             (0x2UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000040 */

#define TIM_CR1_ARPE_Pos          (7U)                                         
#define TIM_CR1_ARPE_Msk          (0x1UL << TIM_CR1_ARPE_Pos)                   /*!< 0x00000080 */
#define TIM_CR1_ARPE              TIM_CR1_ARPE_Msk                             /*!<Auto-reload preload enable */

#define TIM_CR1_CKD_Pos           (8U)                                         
#define TIM_CR1_CKD_Msk           (0x3UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000300 */
#define TIM_CR1_CKD               TIM_CR1_CKD_Msk                              /*!<CKD[1:0] bits (clock division) */
#define TIM_CR1_CKD_0             (0x1UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000100 */
#define TIM_CR1_CKD_1             (0x2UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000200 */

